AlertRuleTemplateName: 
Id: e5af5963-8898-4fe9-b27b-7d928c6f49be
Enabled: true
DisplayName: Suspicious Windows Login outside normal hours
Description: Suspicious Windows Login outside normal hours
Query: "let v_StartTime = 14d;\n  let v_EndTime = 2d;\n  let lookback = 1d;\n  let AllLogonEvents = materialize(\n  SecurityEvent\n  | where TimeGenerated  between (ago(v_StartTime)..ago(v_EndTime))\n  | where EventID in (4624, 4625)\n  | where LogonTypeName in~ ('2 - Interactive','10 - RemoteInteractive')\n  | where AccountType =~ 'User'\n  | extend HourOfLogin = hourofday(TimeGenerated), DayNumberofWeek = dayofweek(TimeGenerated)\n  | extend DayofWeek = case(\n  DayNumberofWeek == \"00:00:00\", \"Sunday\", \n  DayNumberofWeek == \"1.00:00:00\", \"Monday\", \n  DayNumberofWeek == \"2.00:00:00\", \"Tuesday\", \n  DayNumberofWeek == \"3.00:00:00\", \"Wednesday\", \n  DayNumberofWeek == \"4.00:00:00\", \"Thursday\", \n  DayNumberofWeek == \"5.00:00:00\", \"Friday\", \n  DayNumberofWeek == \"6.00:00:00\", \"Saturday\",\"InvalidTimeStamp\")\n  // map the most common ntstatus codes\n  | extend StatusDesc = case(\n  Status =~ \"0x80090302\", \"SEC_E_UNSUPPORTED_FUNCTION\",\n  Status =~ \"0x80090308\", \"SEC_E_INVALID_TOKEN\",\n  Status =~ \"0x8009030E\", \"SEC_E_NO_CREDENTIALS\",\n  Status =~ \"0xC0000008\", \"STATUS_INVALID_HANDLE\",\n  Status =~ \"0xC0000017\", \"STATUS_NO_MEMORY\",\n  Status =~ \"0xC0000022\", \"STATUS_ACCESS_DENIED\",\n  Status =~ \"0xC0000034\", \"STATUS_OBJECT_NAME_NOT_FOUND\",\n  Status =~ \"0xC000005E\", \"STATUS_NO_LOGON_SERVERS\",\n  Status =~ \"0xC000006A\", \"STATUS_WRONG_PASSWORD\",\n  Status =~ \"0xC000006D\", \"STATUS_LOGON_FAILURE\",\n  Status =~ \"0xC000006E\", \"STATUS_ACCOUNT_RESTRICTION\",\n  Status =~ \"0xC0000073\", \"STATUS_NONE_MAPPED\",\n  Status =~ \"0xC00000FE\", \"STATUS_NO_SUCH_PACKAGE\",\n  Status =~ \"0xC000009A\", \"STATUS_INSUFFICIENT_RESOURCES\",\n  Status =~ \"0xC00000DC\", \"STATUS_INVALID_SERVER_STATE\",\n  Status =~ \"0xC0000106\", \"STATUS_NAME_TOO_LONG\",\n  Status =~ \"0xC000010B\", \"STATUS_INVALID_LOGON_TYPE\",\n  Status =~ \"0xC000015B\", \"STATUS_LOGON_TYPE_NOT_GRANTED\",\n  Status =~ \"0xC000018B\", \"STATUS_NO_TRUST_SAM_ACCOUNT\",\n  Status =~ \"0xC0000224\", \"STATUS_PASSWORD_MUST_CHANGE\",\n  Status =~ \"0xC0000234\", \"STATUS_ACCOUNT_LOCKED_OUT\",\n  Status =~ \"0xC00002EE\", \"STATUS_UNFINISHED_CONTEXT_DELETED\",\n  EventID == 4624, \"Success\",\n  \"See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55\"\n  )\n  | extend SubStatusDesc = case(\n  SubStatus =~ \"0x80090325\", \"SEC_E_UNTRUSTED_ROOT\",\n  SubStatus =~ \"0xC0000008\", \"STATUS_INVALID_HANDLE\",\n  SubStatus =~ \"0xC0000022\", \"STATUS_ACCESS_DENIED\",\n  SubStatus =~ \"0xC0000064\", \"STATUS_NO_SUCH_USER\",\n  SubStatus =~ \"0xC000006A\", \"STATUS_WRONG_PASSWORD\",\n  SubStatus =~ \"0xC000006D\", \"STATUS_LOGON_FAILURE\",\n  SubStatus =~ \"0xC000006E\", \"STATUS_ACCOUNT_RESTRICTION\",\n  SubStatus =~ \"0xC000006F\", \"STATUS_INVALID_LOGON_HOURS\",\n  SubStatus =~ \"0xC0000070\", \"STATUS_INVALID_WORKSTATION\",\n  SubStatus =~ \"0xC0000071\", \"STATUS_PASSWORD_EXPIRED\",\n  SubStatus =~ \"0xC0000072\", \"STATUS_ACCOUNT_DISABLED\",\n  SubStatus =~ \"0xC0000073\", \"STATUS_NONE_MAPPED\",\n  SubStatus =~ \"0xC00000DC\", \"STATUS_INVALID_SERVER_STATE\",\n  SubStatus =~ \"0xC0000133\", \"STATUS_TIME_DIFFERENCE_AT_DC\",\n  SubStatus =~ \"0xC000018D\", \"STATUS_TRUSTED_RELATIONSHIP_FAILURE\",\n  SubStatus =~ \"0xC0000193\", \"STATUS_ACCOUNT_EXPIRED\",\n  SubStatus =~ \"0xC0000380\", \"STATUS_SMARTCARD_WRONG_PIN\",\n  SubStatus =~ \"0xC0000381\", \"STATUS_SMARTCARD_CARD_BLOCKED\",\n  SubStatus =~ \"0xC0000382\", \"STATUS_SMARTCARD_CARD_NOT_AUTHENTICATED\",\n  SubStatus =~ \"0xC0000383\", \"STATUS_SMARTCARD_NO_CARD\",\n  SubStatus =~ \"0xC0000384\", \"STATUS_SMARTCARD_NO_KEY_CONTAINER\",\n  SubStatus =~ \"0xC0000385\", \"STATUS_SMARTCARD_NO_CERTIFICATE\",\n  SubStatus =~ \"0xC0000386\", \"STATUS_SMARTCARD_NO_KEYSET\",\n  SubStatus =~ \"0xC0000387\", \"STATUS_SMARTCARD_IO_ERROR\",\n  SubStatus =~ \"0xC0000388\", \"STATUS_DOWNGRADE_DETECTED\",\n  SubStatus =~ \"0xC0000389\", \"STATUS_SMARTCARD_CERT_REVOKED\",\n  EventID == 4624, \"Success\",\n  \"See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55\"\n  )\n  | project StartTime = TimeGenerated, DayofWeek, HourOfLogin, EventID, Activity, IpAddress, WorkstationName, Computer, TargetUserName, TargetDomainName, ProcessName, SubjectUserName, PrivilegeList, LogonTypeName, StatusDesc, SubStatusDesc\n  );\n  AllLogonEvents\n  | where TargetDomainName !in (\"Window Manager\",\"Font Driver Host\")\n  | summarize max(HourOfLogin), min(HourOfLogin), historical_DayofWeek=make_set(DayofWeek) by TargetUserName\n  | join kind= inner\n  (\n      AllLogonEvents\n      | where StartTime > ago(lookback)\n  )\n  on TargetUserName\n  // Filtering for logon events based on range of max and min of historical logon hour values seen\n  | where HourOfLogin > max_HourOfLogin or HourOfLogin < min_HourOfLogin\n  // Also populating additional column showing historical days of week when logon was seen\n  | extend historical_DayofWeek = tostring(historical_DayofWeek)\n  | summarize Total= count(), max(HourOfLogin), min(HourOfLogin), current_DayofWeek =make_set(DayofWeek), StartTime=max(StartTime), EndTime = min(StartTime), SourceIP = make_set(IpAddress), SourceHost = make_set(WorkstationName), SubjectUserName = make_set(SubjectUserName), HostLoggedOn = make_set(Computer) by EventID, Activity, TargetDomainName, TargetUserName , ProcessName , LogonTypeName, StatusDesc, SubStatusDesc, historical_DayofWeek\n  | extend historical_DayofWeek = todynamic(historical_DayofWeek) \n  | extend timestamp = StartTime, AccountCustomEntity = TargetUserName"
SeveritiesFilter: 
Severity: Medium
QueryFrequency: PT5M
QueryPeriod: PT5M
TriggerOperator: GreaterThan
TriggerThreshold: 0
Tactics: 
- CredentialAccess
EventGroupSettings: 
SuppressionDuration: PT1H
SuppressionEnabled: false
IncidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5M
    entitiesMatchingMethod: All
    groupByEntities: []
EntityMappings: 
Kind: Scheduled
