AlertRuleTemplateName: 
Id: 93506ad6-ad82-451e-97d6-f277db2799b7
Enabled: true
DisplayName: Rare and potentially high-risk Office operations
Description: ""
Query: |-
  OfficeActivity
    | where Operation in~ ( "Add-MailboxPermission", "Add-MailboxFolderPermission", "Set-Mailbox", "New-ManagementRoleAssignment")
    and not(UserId has_any ('NT AUTHORITY\\SYSTEM (Microsoft.Exchange.ServiceHost)','devilfish-applicationaccount') and Operation in~ ( "Add-MailboxPermission", "Set-Mailbox"))
    | extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = ClientIP
SeveritiesFilter: 
Severity: Medium
QueryFrequency: P1D
QueryPeriod: P1D
TriggerOperator: GreaterThan
TriggerThreshold: 0
Tactics:
- Collection
- Persistence
EventGroupSettings:
  aggregationKind: SingleAlert
SuppressionDuration: PT5H
SuppressionEnabled: false
IncidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    entitiesMatchingMethod: All
    groupByEntities: []
EntityMappings: 
Kind: Scheduled
