AlertRuleTemplateName: 
Id: 825dd589-32ac-436b-91fb-a99f0c233894
Enabled: true
DisplayName: SQL - Use Brute Force to obtain valid SQL credentials
Description: ""
Query: |-
  SecurityAlert
  | where ProductName == "Azure Security Center"
  | where CompromisedEntity has "SQL"
  | where parse_json(ExtendedProperties).resourceType == "SQL Database"
  | where AlertName has "SQL Brute Force"
  | where Type == "SecurityAlert"
  | extend Address_ = tostring(parse_json(Entities)[0].Address)
  | extend City_ = tostring(parse_json(tostring(parse_json(Entities)[0].Location)).City)
  | extend CountryName_ = tostring(parse_json(tostring(parse_json(Entities)[0].Location)).CountryName)
  | extend Client_Principal_Name_ = tostring(parse_json(ExtendedProperties).["Client Principal Name"])
  | extend Client_Application_ = tostring(parse_json(ExtendedProperties).["Client Application"])
SeveritiesFilter: 
Severity: High
QueryFrequency: PT5M
QueryPeriod: PT6M
TriggerOperator: GreaterThan
TriggerThreshold: 0
Tactics:
- CredentialAccess
EventGroupSettings:
  aggregationKind: AlertPerResult
SuppressionDuration: PT5H
SuppressionEnabled: false
IncidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    entitiesMatchingMethod: All
    groupByEntities: []
EntityMappings:
- entityType: AzureResource
  fieldMappings:
  - identifier: ResourceId
    columnName: ResourceId
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: Address_
- entityType: Account
  fieldMappings:
  - identifier: Name
    columnName: Client_Principal_Name_
Kind: Scheduled
