AlertRuleTemplateName: 
Id: efa5ab1a-26ce-463b-ae5d-f62d9ab63341
Enabled: true
DisplayName: RDP Multiple Connections From Single System
Description: RDP Multiple Connections From Single System
Query: "let endtime = 1d;\n  let starttime = 8d;\n  let threshold = 2.0;\n  SecurityEvent\n  | where TimeGenerated >= ago(endtime) \n  | where EventID == 4624 and LogonType == 10\n  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), ComputerCountToday = dcount(Computer), ComputerSet = makeset(Computer), ProcessSet = makeset(ProcessName)  \n  by Account, IpAddress, AccountType, Activity, LogonTypeName\n  | join kind=inner (\n  SecurityEvent\n  | where TimeGenerated >= ago(starttime) and TimeGenerated < ago(endtime) \n  | where EventID == 4624 and LogonType == 10\n  | summarize ComputerCountPrev7Days = dcount(Computer) by Account, IpAddress\n  ) on Account, IpAddress\n  | extend Ratio = ComputerCountToday/(ComputerCountPrev7Days*1.0)\n  // Where the ratio of today to previous 7 days is more than double.\n  | where Ratio > threshold\n  | project StartTimeUtc, EndTimeUtc, Account, IpAddress, ComputerSet, ComputerCountToday, ComputerCountPrev7Days, Ratio, AccountType, Activity, LogonTypeName, ProcessSet\n  | extend timestamp = StartTimeUtc, AccountCustomEntity = Account, IPCustomEntity = IpAddress"
SeveritiesFilter: 
Severity: Medium
QueryFrequency: PT5M
QueryPeriod: PT5M
TriggerOperator: GreaterThan
TriggerThreshold: 0
Tactics: 
- InitialAccess
EventGroupSettings: 
SuppressionDuration: PT1H
SuppressionEnabled: false
IncidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5M
    entitiesMatchingMethod: All
    groupByEntities: []
EntityMappings: 
Kind: Scheduled
